# 1.Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки на максимальные.
#  Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.
# Input: 5 -> 1 3 3 3 4
# Output: 1 3 3 3 1


# count = int(input("введите кол-о ваших оценок: \n"))
# b = [0]
# b = b * count
# for i in range(len(b)):
#     num = int(input('Введите оценку: '))
#     b[i] = num
# print('ваши оценки: ', b)    
# for j in range(len(b)):
#     if b[j] > 3:
#         b[j] = 2
# print('Изменённые оценки: ',b)
    
    
# 2. Дано натуральное число N и последовательность из N элементов. Требуется вывести эту последовательность в обратном порядке.
# Примечание. В программе запрещается объявлять массивы и использовать циклы (даже для ввода и вывода). Через рекурсию необходимо делать
# Input: 2 -> 3 4
# Output: 4 3


